<img src='https://user-images.githubusercontent.com/6457691/89746244-a6e2a200-daf3-11ea-9314-7863d544d73c.png' width = '200' align = 'right'>

## *DATA SCIENCE / SECTION 1 / SPRINT 1 / NOTE 3*

# 📝 Assignment

---

# 1. Enumerate

- 1 이상 50 이하의 정수 10개를 랜덤으로 생성하여 arr에 저장합니다.
  - `np.random.seed(1)`로 설정합니다. 

- `enumerate`를 사용하여 짝수 번째 수들의 합은 res1에, 홀수 번째 수들의 합은 res2에 저장합니다.

In [30]:
import pandas as pd
import numpy as np

np.random.seed(1)

arr = np.random.randint(0,51,10)

res1 = 0
res2 = 0

for i in range(5):
  res1 += arr[i * 2]
  res2 += arr[i * 2 + 1]

print(res1, res2)

63 93

# 2. Apply

- 주어진 url의 데이터셋을 불러옵니다. 

- 결측치는 0으로 대체합니다. 

- 데이터셋의 분기를 제외한 모든 feature에 대해서 수치형 데이터(`int`, `float`)로 변환하고, `.describe()`을 통해 summary statistics를 확인하세요.

In [117]:
url = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/kt%26g/kt%26g_0.csv'
headers = ['분기', '매출액', '영업이익', '영업이익(발표기준)', '세전계속사업이익',
           '당기순이익', '당기순이익(지배)', '당기순이익(비지배)', '자산총계', '부채총계',
           '자본총계', '자본총계(지배)', '자본총계(비지배)', '자본금', '영업활동현금흐름',
           '투자활동현금흐름', '재무활동현금흐름', '영업이익률', '순이익률', 'ROE(%)',
           'ROA(%)', '부채비율', '자본유보율', 'EPS(원)', 'PER(배)']

In [125]:
# 주어진 url의 데이터셋을 불러오기
df1 = pd.read_csv(url)
df_first = [list(df1.columns)]
df1.columns = headers
df = pd.DataFrame(df_first, columns = headers).append(df1.loc[:]).reset_index(drop = True)

# 결측치 0으로 대체
df.fillna(0, inplace = True)

# 데이터셋의 분기를 제외한 모든 feature에 대해서 수치형 데이터(int, float)로 변환
changes = ["매출액", "영업이익", "영업이익(발표기준)", "세전계속사업이익", "당기순이익", "당기순이익(지배)", 
           "자산총계", "부채총계", "자본총계", "자본총계(지배)", "자본금", "영업활동현금흐름", "투자활동현금흐름", 
           "재무활동현금흐름", "EPS(원)"]

def toFloat(string):                          #
    return float(string.replace(',',''))      #
                                              # 이 부분 다시 공부하기
for i in changes:                             #
    df[i] = df[i].apply(toFloat)              #

df.describe()

,매출액,영업이익,영업이익(발표기준),세전계속사업이익,당기순이익,당기순이익(지배),자산총계,부채총계,자본총계,자본총계(지배),자본금,영업활동현금흐름,투자활동현금흐름,재무활동현금흐름,EPS(원)
count,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.00000,5.00000,5.000000,5.0,5.000000,5.000000,5.00000,5.000000
mean,12550.800000,3487.200000,3487.220000,3785.000000,2704.600000,2699.000000,108155.000000,22988.20000,85166.80000,84604.000000,9550.0,2678.200000,-813.600000,-2192.80000,1966.000000
std,664.979097,636.931079,636.950855,1131.079131,863.422724,851.338358,1522.396795,2560.38419,1988.82596,1988.427897,0.0,3831.542731,783.981696,2763.51139,619.939513
min,11784.000000,2523.000000,2523.000000,1794.000000,1183.000000,1198.000000,106314.000000,20062.00000,82524.00000,81965.000000,9550.0,-2278.000000,-1878.000000,-5501.00000,873.000000
25%,11982.000000,3150.000000,3150.000000,4020.000000,2935.000000,2930.000000,107121.000000,20691.00000,83732.00000,83170.000000,9550.0,837.000000,-1392.000000,-4919.00000,2134.000000
50%,12578.000000,3825.000000,3825.000000,4156.000000,2939.000000,2931.000000,108464.000000,23386.00000,85623.00000,85049.000000,9550.0,2336.000000,-501.000000,-329.00000,2135.000000
75%,13188.000000,3947.000000,3947.000000,4452.000000,3221.000000,3208.000000,108594.000000,24862.00000,86896.00000,86330.000000,9550.0,4641.000000,-214.000000,-129.00000,2337.000000
max,13222.000000,3991.000000,3991.100000,4503.000000,3245.000000,3228.000000,110282.000000,25940.00000,87059.00000,86506.000000,9550.0,7855.000000,-83.000000,-86.00000,2351.000000

# 3. Regular Expression (정규표현식) 

Note3에서 여러 데이터 이슈들을 살펴보았는데, Note4에서는 이러한 이슈들을 해결하기 위한 방법 중 정규표현식을 사용합니다. 
- 정규표현식에 대하여 찾아보고, 다음 method를 사용하여 문제를 풀어 보세요. 
  - `search`
  - `findall`
  - `sub`

In [1]:
import re

In [26]:
text = "The Lord of the Rings 3 : The Return Of The King, by J.R.R. Tolkien - 123"

In [6]:
re.search("The", text)

In [11]:
re.findall('The', text)

['The', 'The', 'The']

In [16]:
re.search('he', text)
re.search('[a-z]+', text)

In [17]:
re.findall('[a-z]+', text)

['he',
 'ord',
 'of',
 'the',
 'ings',
 'he',
 'eturn',
 'f',
 'he',
 'ing',
 'by',
 'olkien']

In [20]:
re.findall('[0-9]', text)
re.findall('\d', text)

['3', '1', '2', '3']

In [22]:
re.findall('[0-9]+', text)
re.findall('\d+', text)

['3', '123']

In [27]:
re.sub('[A-Z]', '_', text)

'_he _ord of the _ings 3 : _he _eturn _f _he _ing, by _._._. _olkien - 123'

In [29]:
re.sub('[:-]', '', text)

'The Lord of the Rings 3  The Return Of The King, by J.R.R. Tolkien  123'

# 4. Data Issue 탐색
- 데이터셋(customer, rental, payment)을 불러온 후, 시각적 탐색 혹은 프로그래매틱 탐색 방법으로 데이터 이슈들을 탐색해 보세요. 
  - 데이터 품질의 문제를 설명해 보세요.
    - 결측치, 중복, 부정확한 데이터 등이 있는지 확인합니다. 
    - 각 column의 데이터 타입을 확인합니다. 
  - 데이터 구조의 문제를 설명해 보세요. 
    - 각 변수는 하나의 column을 구성해야 합니다. 
    - 각 관측치는 하나의 row를 구성해야 합니다.

In [31]:
from google.colab import files
file = files.upload()

Saving customer.csv to customer.csv
Saving payment.csv to payment.csv
Saving rental.csv to rental.csv

In [57]:
# 데이터셋(customer, rental, payment)을 불러오기
df_customer = pd.read_csv('customer.csv', index_col = 'Unnamed: 0')
df_payment = pd.read_csv('payment.csv', index_col = 'Unnamed: 0')
df_rental = pd.read_csv('rental.csv', index_col = 'Unnamed: 0')

In [48]:
# customer
df_customer.info()
df_customer.dropna(axis = 0, inplace = True)
df_customer.duplicated().sum()
df_customer.loc[523:525]

<class 'pandas.core.frame.DataFrame'>
Int64Index: 599 entries, 0 to 598
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   599 non-null    int64
 1   customer_id  599 non-null    object
 2   store_id     599 non-null    float64
 3   email        599 non-null    object
 4   address_id   599 non-null    float64
 5   activebool   599 non-null    object
 6   create_date  599 non-null    object
 7   last_update  599 non-null    object
 8   active       599 non-null    float64
 9   name         599 non-null    object
dtypes: float64(3), int64(1), object(6)
memory usage: 51.5+ KB

,Unnamed: 0,customer_id,store_id,email,address_id,activebool,create_date,last_update,active,name
523,523,523,1.0,harvey.guajardo@sakilacustomer.org,529.0,t,2006-02-14,2013-05-26 14:49:45.738,1.0,"Harvey, Guajardo"
524,524,525,2.0,adrian.clary@sakilacustomer.org,531.0,t,2006-02-14,2013-05-26 14:49:45.738,1.0,"Adrian, Clary"
525,525,526,2.0,karl.seal@sakilacustomer.org,532.0,t,2006-02-14,2013-05-26 14:49:45.738,1.0,"Karl, Seal"

In [ ]:
# customer 데이터 문제
# 1. 결측치 마지막 행 존재, 중복은 없음
# 2. customer_id : object, store_id : float64, email : object, address_id : float64, activebool : object ~
# 3. name column에 2개의 변수가 존재

In [75]:
# payment
df_payment.info()
df_payment.dropna(axis = 0, inplace = True)
df_payment.duplicated().sum()
df_payment.amount = df_payment.amount.str.replace('$','').astype(float)
df_payment

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14596 entries, 0 to 14595
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   payment_id    14596 non-null  object
 1   customer_id   14596 non-null  float64
 2   staff_id      14596 non-null  float64
 3   rental_id     14596 non-null  float64
 4   amount        14596 non-null  object
 5   payment_date  14596 non-null  object
dtypes: float64(3), object(3)
memory usage: 798.2+ KB

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  """

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,17503,341.0,2.0,1520.0,7.99,2007-02-15 22:25:46.996577
1,17504,341.0,1.0,1778.0,1.99,2007-02-16 17:23:14.996577
2,17505,341.0,1.0,1849.0,7.99,2007-02-16 22:41:45.996577
3,17506,341.0,2.0,2829.0,2.99,2007-02-19 19:39:56.996577
4,17507,341.0,2.0,3130.0,7.99,2007-02-20 17:31:48.996577
...,...,...,...,...,...,...
14591,32094,245.0,2.0,12682.0,2.99,2007-05-14 13:44:29.996577
14592,32095,251.0,1.0,14107.0,0.99,2007-05-14 13:44:29.996577
14593,32096,252.0,2.0,13756.0,4.99,2007-05-14 13:44:29.996577
14594,32097,263.0,1.0,15293.0,0.99,2007-05-14 13:44:29.996577
14595,32098,264.0,2.0,14243.0,2.99,2007-05-14 13:44:29.996577

In [ ]:
# payment 데이터 문제
# 1. 결측치 마지막 행 존재, 중복은 없음
# 2. payment_id : object, customer_id : float64, staff_id : float64, rental_id : float64 ~
# 3. amount에 $ 존재 , 제거 후 타입 float64로 변환

In [72]:
# rental
df_rental.info()
df_rental.duplicated().sum()
df_rental.dropna(axis = 0, inplace = True)
df_rental

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16044 entries, 0 to 16043
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     16044 non-null  object
 1   rental_date   16044 non-null  object
 2   inventory_id  16044 non-null  float64
 3   customer_id   16044 non-null  float64
 4   return_date   16044 non-null  object
 5   staff_id      16044 non-null  float64
 6   last_update   16044 non-null  object
dtypes: float64(3), object(4)
memory usage: 1002.8+ KB

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,2,2005-05-24 22:54:33,1525.0,459.0,2005-05-28 19:40:33,1.0,2006-02-16 02:30:53
1,3,2005-05-24 23:03:39,1711.0,408.0,2005-06-01 22:12:39,1.0,2006-02-16 02:30:53
2,4,2005-05-24 23:04:41,2452.0,333.0,2005-06-03 01:43:41,2.0,2006-02-16 02:30:53
3,5,2005-05-24 23:05:21,2079.0,222.0,2005-06-02 04:33:21,1.0,2006-02-16 02:30:53
4,6,2005-05-24 23:08:07,2792.0,549.0,2005-05-27 01:32:07,1.0,2006-02-16 02:30:53
...,...,...,...,...,...,...,...
16039,16046,2005-08-23 22:26:47,4364.0,74.0,2005-08-27 18:02:47,2.0,2006-02-16 02:30:53
16040,16047,2005-08-23 22:42:48,2088.0,114.0,2005-08-25 02:48:48,2.0,2006-02-16 02:30:53
16041,16048,2005-08-23 22:43:07,2019.0,103.0,2005-08-31 21:33:07,1.0,2006-02-16 02:30:53
16042,16049,2005-08-23 22:50:12,2666.0,393.0,2005-08-30 01:01:12,2.0,2006-02-16 02:30:53
16043,1,2005-05-24 22:53:30,367.0,130.0,2005-05-26 22:04:30,1.0,2006-02-15 21:30:53

In [ ]:
# rental 데이터 문제
# 1. 결측치 마지막 행 존재, 중복은 없음
# 2. rental_id : object, rental_date : object, inventory_id : float64, customer_id : float64 ~

# 🔥 도전과제 

**해당 도전과제는 n114의 도전과제로 이어집니다.**

## concat

- 주어진 6개의 데이터에 대하여 다음 업무를 수행합니다. 
  - 데이터를 transpose 합니다.
  - 첫 번째 row를 column name으로 설정합니다. 
  - `매출액`, `자본총계`, `EPS(원)` column만 사용합니다.
  - 제일 최근 분기의 데이터만 사용합니다. 

- 위의 업무를 모두 수행한 후 6개의 데이터를 `.concat()`을 활용하여 1개로 합칩니다. 

- 합친 데이터와 `종목명` 데이터를 `.concat()`을 사용하여 합칩니다.
  - 다음과 같은 `종목명` 데이터를 생성해야 합니다.

||종목명|
|:-:|:-:|
|0|하이트진로|
|1|보해양조|
|2|롯데칠성|
|3|마니커|
|4|이지홀딩스|
|5|하림| 

- 합친 이후의 index는 `분기`로 설정하고, 기존 index는 drop 합니다. 
  - 다음과 같은 결과가 나와야 합니다. 

||매출액|자본총계|EPS(원)|종목명|
|:-:|:-:|:-:|:-:|:-:|
|2020/09|6,243|10,897|453|하이트진로|
|...|...|...|...|...|
|2020/09|2,613|2,695|62|하림|

In [ ]:
data1 = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/stocks/000080.csv'
data2 = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/stocks/000890.csv'
data3 = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/stocks/005300.csv'
data4 = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/stocks/027740.csv'
data5 = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/stocks/035810.csv'
data6 = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/stocks/136480.csv'

In [ ]:
# 이 도전과제는 이어지는 N114에서 ~